# Первая лекция по преподавателю МФТИ (Тимофею Харьянову)
# Программирование состоит из:
# 1) Синтаксис Языка Программирования (Языки программирования приходят и умирают) (Минимальное акцентирование)
# 2) Прикладные библиотеки (Библиотеки приходят и уходят (справочные информации))
# 3) Алгоритмы и структуры данных (Не меняются по прошествии многих лет)
# 4) Дизайн Программного обеспечения (Дизайн ПО) (2 курс по лекциям Тимофея Харьянова)
# 5) Практика программирования 
# 6) Групповая работа (После базовых вещей, в первом курсе не будет)
#
# Подтема №1 Синтаксис Python 3
#
# Имена     Значения
#   x ---> "Hello World" (str)
#           type ("Hello World") = str
#   x --->    9 (int)
# В случае питона мы начинаем ссылаться на значение 
#   
# Обычное присваевание в 1.1 и 1.2
# Каскадное присваивание a = b = c = z = 0
#
#
#
#
#
#