a = True
b = False
d = ((a and b) or ((not a) and (not b)))
"""
Блин! Не понятно излагается задание.
Думаю так будет намного понятней:
Пять операторов, пять пар скобок. Обозначить выполнение каждого оператора скобками (то есть, поставить с каждой стороны 
от оператора скобки  заключив в них ближайшие операнды) таким образом что бы выражение выполнилось так же как 
и без скобок.
напоминалка: первым выполняется not, вторым and , третьим or.

Операторы бывают бинарными и унарными.  and и  or - бинарные.  not - унарный. 
При использовании бинарного оператора операнды записываются перед и после (справа и слева) оператора. 
При использовании унарного оператора операнд записывается после оператора (справа от оператора).
"""
