# Цикл while
# Синтаксис
# while условие :  (заголовок)
    # оператор 1   (тело цикла)
    # оператор 2 
    # оператор 3
    # ..........
    # оператор n
# после

# Итерация - это однократное выполнение тела цикла (ход выполнения)
# Цикл while может бесконечно зациклится

# while условие :  (заголовок)
    # оператор 1   (тело цикла)
    # оператор 2 
    # оператор 3
    # ..........
    # оператор n
# else :
    # после всех итераций   
#после 
#
# можем поставить break (инструкцию)
# while условие :  (заголовок)
    # оператор 1   (тело цикла)
    # if что-то:
        # break
    # оператор 3
    # ..........
    # оператор n
# else :
    # после всех итераций   
#
# while 2+2==4 :   (заголовок)   (==сравнение)
    # оператор 1   (тело цикла)
    # if что-то:
        # break
    # оператор 3
    # ..........
    # оператор n
# else :
    # после всех итераций   
#
# Биатлон в лекции (на каждой итерации большого цикла может быть цикл, принцип матрешки)
#
# while x>0:
    # y=x
    # while y>0
        # y-=1 (новый оператор присваивания) (синтаксический сахар)   
#  
# 
#