import itertools


def sudoku(puzzle):
    a = [] #массив
    indices = [] # индексы элементов равные 0
    count = 0
    for item in puzzle:
        for i in range(0, 9, 1):
            a.append(item[i])
    indices = [i for i, x in enumerate(a) if x == 0]
    print(indices)
    count = len(indices)
    print(81-count)
    b = a.copy()

    for mas in itertools.product(*[range(0, 9, 1) for indices in range(count)]):
        if b[0]+b[1]+b[2]+b[3]+b[4]+b[5]+b[6]+b[7]+b[8] == 36 and \
        b[9]+b[10]+b[11]+b[12]+b[13]+b[14]+b[15]+b[16]+b[17] == 36 and \
        b[18]+b[19]+b[20]+b[21]+b[22]+b[23]+b[24]+b[25]+b[26] == 36 and \
        b[27]+a[28]+b[29]+b[30]+b[31]+b[32]+b[33]+b[34]+b[35] == 36 and \
        b[36]+b[37]+b[38]+b[39]+b[40]+b[41]+b[42]+b[43]+b[44] == 36 and \
        b[46]+b[47]+b[48]+b[49]+b[50]+b[51]+b[52]+b[53]+b[54] == 36 and \
        b[55]+b[56]+b[57]+b[58]+b[59]+b[60]+b[61]+b[62]+b[63] == 36 and \
        b[64]+b[65]+b[66]+b[67]+b[68]+b[69]+b[70]+b[71]+b[72] == 36 and \
        b[73] + b[74] + b[75] + b[76]+ b[77]+b[78]+b[79]+b[80]+b[81] == 36 and \
        b[0] + b[1] + b[2] + b[9] + b[10] + b [11] + b[12] + b[18] + b[19] + b[20] == 36 and \
        b[4]+b[5]+b[6] +b[12]+b[13]+b[14] +b[21]+b[22]+b[23] == 36 and \
        b[6]+b[7]+b[8] + b[15]+b[16]+b[17]+b[24]+b[25]+b[26] == 36 and \
        b[27]+b[28]+b[29] + b[36]+b[37]+b[38] + b[46]+b[47]+b[48] == 36 and \
        b[30]+b[31]+b[32] + b[39]+b[40]+b[41] +b[49]+b[50]+b[51] == 36 and \
        b[33]+b[34]+b[35] + b[42]+b[43]+b[44] + b[52]+b[53]+b[54] == 36 and \
        b[55]+b[56]+b[57] + b[64]+b[65]+b[66] + b[73] + b[74] + b[75] == 36 and \
        b[58]+b[59]+b[60] +b[67]+b[68]+b[69] + b[76]+ b[77]+b[78] == 36 and \
        b[61]+b[62]+b[63] +b[70]+b[71]+b[72] +b[79]+b[80]+b[81] == 36:
            print(b)



puzzle = [[0, 0, 6, 1, 0, 0, 0, 0, 8],[0, 8, 0, 0, 9, 0, 0, 3, 0],[2, 0, 0, 0, 0, 5, 4, 0, 0],[4, 0, 0, 0, 0, 1, 8, 0, 0],[0, 3, 0, 0, 7, 0, 0, 4, 0],[0, 0, 7, 9, 0, 0, 0, 0, 3],[0, 0, 8, 4, 0, 0, 0, 0, 6],[0, 2, 0, 0, 5, 0, 0, 8, 0],[1, 0, 0, 0, 0, 2, 5, 0, 0]]
sudoku(puzzle)
print(sudoku(puzzle))
